{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Rule Name": {
      "defaultValue": "AZT503.1 - HTTP Trigger: Logic Application HTTP Trigger",
      "type": "String"
    }
  },
  "variables": {},
  "resources": [
    {
      "type": "microsoft.insights/scheduledqueryrules",
      "apiVersion": "2022-06-15",
      "name": "[parameters('Rule Name')]",
      "location": "[resourceGroup().location]",
      "properties": {
        "displayName": "[parameters('Rule Name')]",
        "description": "Will alert whenever an HTTP trigger is created on a Logic Application.",
        "severity": 2,
        "enabled": true,
        "evaluationFrequency": "PT15M",
        "Scopes": [
          "[subscription().id]"
        ],
        "windowSize": "PT15M",
        "criteria": {
          "allOf": [
            {
              "query": "AzureActivity | where OperationNameValue=='Microsoft.Logic/locations/workflows/recommendOperationGroups/action' or OperationNameValue=='Microsoft.Logic/workflows/triggers/listCallbackUrl/action' or OperationNameValue=='Microsoft.Web/connections/write'",
              "timeAggregation": "Count",
              "dimensions": [],
              "operator": "GreaterThanOrEqual",
              "threshold": 1,
              "failingPeriods": {
                "numberOfEvaluationPeriods": 1,
                "minFailingPeriodsToAlert": 1
              }
            }
          ]
        },
        "autoMitigate": false
      }
    }
  ]
}