{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Rule Name": {
      "defaultValue": "AZT703 - Replication: Storage Account Replication",
      "type": "String"
    }
  },
  "variables": {},
  "resources": [
    {
      "type": "microsoft.insights/scheduledqueryrules",
      "apiVersion": "2022-06-15",
      "name": "[parameters('Rule Name')]",
      "location": "centralus",
      "properties": {
        "displayName": "[parameters('Rule Name')]",
        "description": "Will alert when a replication policy is created in a Storage Account.",
        "severity": 2,
        "enabled": true,
        "evaluationFrequency": "PT15M",
        "Scopes": [
          "[subscription().id]"
        ],
        "windowSize": "PT15M",
        "criteria": {
          "allOf": [
            {
              "query": "AzureActivity | where OperationNameValue=='Microsoft.Storage/storageAccounts/objectReplicationPolicies/write'",
              "timeAggregation": "Count",
              "dimensions": [],
              "operator": "GreaterThanOrEqual",
              "threshold": 1,
              "failingPeriods": {
                "numberOfEvaluationPeriods": 1,
                "minFailingPeriodsToAlert": 1
              }
            }
          ]
        },
        "autoMitigate": false
      }
    }
  ]
}