{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "Rule Name": {
      "defaultValue": "AZT605.2 - Resource Secret Reveal: Automation Account Credential Secret Dump",
      "type": "String"
    }
  },
  "variables": {},
  "resources": [
    {
      "type": "microsoft.insights/scheduledqueryrules",
      "apiVersion": "2022-06-15",
      "name": "[parameters('Rule Name')]",
      "location": "centralus",
      "properties": {
        "displayName": "[parameters('Rule Name')]",
        "description": "Will alert whenever a Runbook is configured to dump pre-configured credentials.",
        "severity": 2,
        "enabled": true,
        "evaluationFrequency": "PT15M",
        "Scopes": [
          "[subscription().id]"
        ],
        "windowSize": "PT15M",
        "criteria": {
          "allOf": [
            {
              "query": "AzureActivity  |where OperationNameValue=='Microsoft.Automation/automationAccounts/jobs/write' or OperationNameValue=='Microsoft.Automation/automationAccounts/runbooks/publish/action' or OperationNameValue=='Microsoft.Automation/automationAccounts/runbooks/draft/write' or OperationNameValue=='Microsoft.Automation/automationAccounts/runbooks/write'",
              "timeAggregation": "Count",
              "dimensions": [],
              "operator": "GreaterThanOrEqual",
              "threshold": 1,
              "failingPeriods": {
                "numberOfEvaluationPeriods": 1,
                "minFailingPeriodsToAlert": 1
              }
            }
          ]
        },
        "autoMitigate": false
      }
    }
  ]
}